[
  {
    "bookId": 1,
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co/RBqyGS9/The-silent-patient.png",
    "review": "A gripping psychological thriller with an unpredictable twist. The narrative keeps you hooked until the very end. Alex Michaelides masterfully crafts a suspenseful story filled with secrets and intrigue. The twists and turns in the plot will leave you questioning everyone's motives until the final revelation.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "bookId": 2,
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co/JjKm2VQ/sapiens.png",
    "review": "An insightful journey through human history that challenges our understanding of society, culture, and evolution. Yuval Noah Harari takes readers on an intellectual expedition, exploring how Homo sapiens came to dominate the planet. With thought-provoking discussions on the future, Sapiens bridges the gap between history and modern-day implications.",
    "totalPages": 443,
    "rating": 4.8,
    "category": "Non-fiction",
    "tags": ["History", "Philosophy", "Anthropology"],
    "publisher": "Harper",
    "yearOfPublishing": 2015
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/3FXGhRJ/1984.png",
    "review": "A timeless dystopian novel that explores the dangers of totalitarianism and extreme political ideology. Orwell’s chilling vision of the future feels eerily relevant in today’s world, with its depiction of surveillance and the manipulation of truth. The book forces readers to reflect on freedom, power, and individual rights in society.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Dystopia", "Political Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/59vg0Zp/the-alchemist.png",
    "review": "A philosophical tale about following your dreams and the journey to find meaning and purpose in life. Paulo Coelho weaves a magical and uplifting story, filled with wisdom and spiritual insight. The Alchemist encourages readers to trust their instincts and to listen to their hearts, reminding them that every journey is as important as its destination.",
    "totalPages": 208,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Adventure", "Philosophy", "Spiritual"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 5,
    "bookName": "Becoming",
    "author": "Michelle Obama",
    "image": "https://i.ibb.co/vL7Fx8K/Becoming.jpg",
    "review": "A candid and deeply personal memoir from the former First Lady, inspiring readers with her journey of self-discovery and resilience. Michelle Obama reflects on her life, from her childhood in Chicago to her years in the White House. Her honest and empowering narrative reveals the strength behind her public persona and the values that have guided her life.",
    "totalPages": 448,
    "rating": 4.9,
    "category": "Biography",
    "tags": ["Memoir", "Inspiration", "Politics"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 6,
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "https://i.ibb.co/G9rvJnZ/Atomic-habits.png",
    "review": "A practical guide to building good habits and breaking bad ones. Clear provides actionable strategies for personal growth. The book emphasizes the power of small changes and how minor adjustments can lead to life-altering habits. Readers will find inspiration to take control of their habits and lead more productive lives.",
    "totalPages": 320,
    "rating": 4.6,
    "category": "Self-help",
    "tags": ["Productivity", "Behavioral Science", "Personal Development"],
    "publisher": "Avery",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 7,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/Wxm0b0x/to-kill-a-mockingbird.png",
    "review": "A powerful exploration of racial injustice in the Deep South, told through the eyes of a young girl. Harper Lee’s timeless novel remains relevant, with its poignant portrayal of humanity and the fight for equality. It tackles serious themes like racial prejudice, innocence, and moral growth in a way that resonates deeply with readers of all ages.",
    "totalPages": 281,
    "rating": 4.9,
    "category": "Fiction",
    "tags": ["Classic", "Social Justice", "Historical"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 8,
    "bookName": "The Power of Habit",
    "author": "Charles Duhigg",
    "image": "https://i.ibb.co/kXQd5tm/the-power-of-habit.webp",
    "review": "A compelling read that delves into how habits work and how understanding them can lead to success in life and business. Duhigg breaks down the science behind habit formation, offering real-world examples and actionable advice. The Power of Habit empowers readers to change their routines and achieve more through deliberate, positive habit-building.",
    "totalPages": 371,
    "rating": 4.4,
    "category": "Self-help",
    "tags": ["Psychology", "Behavioral Science", "Productivity"],
    "publisher": "Random House",
    "yearOfPublishing": 2012
  },
  {
    "bookId": 9,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/2vWZdHz/the-catcher-of-rye.jpg",
    "review": "A controversial classic, this coming-of-age novel dives deep into the struggles of teenage alienation and identity. Salinger’s portrayal of Holden Caulfield captures the confusion and angst of adolescence. The novel remains a powerful reflection on isolation, societal expectations, and the search for authenticity.",
    "totalPages": 277,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Classic", "Coming-of-Age", "Psychological"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 10,
    "bookName": "Thinking, Fast and Slow",
    "author": "Daniel Kahneman",
    "image": "https://i.ibb.co/Lv3G4Wz/thinking-fast-and-slow.png",
    "review": "An enlightening exploration of how humans make decisions, blending psychology and behavioral economics. Kahneman introduces two distinct systems of thinking—fast, intuitive reactions and slow, deliberate reasoning. His research offers profound insights into how these modes of thinking shape our perceptions, decisions, and actions in everyday life.",
    "totalPages": 499,
    "rating": 4.6,
    "category": "Non-fiction",
    "tags": ["Psychology", "Economics", "Cognitive Science"],
    "publisher": "Farrar, Straus and Giroux",
    "yearOfPublishing": 2011
  }
]
